import numpy as np
from scipy import stats

fp = np.array([173, 175, 180, 178, 177, 185, 183, 182], dtype=np.float64)
hp = np.array([177, 179, 180, 188, 177, 172, 171, 184, 180], dtype=np.float64)
lf = np.array([172, 173, 169, 177, 166, 180, 178, 177, 172, 166, 170], dtype=np.float64)

n1 = fp.shape[0]
n2 = hp.shape[0]
n3 = lf.shape[0]

fp_mean = fp.mean()
hp_mean = hp.mean()
lf_mean = lf.mean()

print(f"Среднее значение роста футболистов = {fp_mean:.2f}")
print(f"Среднее значение роста хоккеистов = {hp_mean:.2f}")
print(f"Среднее значение роста штангистов = {lf_mean:.2f}")

"Среднее значение роста футболистов = 179.12"
"Среднее значение роста хоккеистов = 178.67"
"Среднее значение роста штангистов = 172.73"

 #средние роста хокеистов и футболистов отличаются не сильно. Проверим статистическую значимость всех отличий.

y = np.concatenate([fp, hp, lf])
y_mean = y.mean()
print(f"Среднее значение роста спортсменов = {y_mean:.2f}")

"Среднее значение роста спортсменов =176.46428571428572"

#Найдём значения Sf и Sres

S2_F = n1 * (fp_mean - y_mean) ** 2 + n2 * (hp_mean - y_mean) ** 2 + n3 * (lf_mean - y_mean) ** 2
S2_res = ((fp - fp_mean) ** 2).sum() + ((hp - hp_mean) ** 2).sum() + ((lf - lf_mean) ** 2).sum()

S2 = ((y - y_mean) ** 2).sum()

print(f" Sf^2 = {S2_F:.2f}")
print(f" Sres^2 = {S2_res:.2f}")
print()
print(f" S^2 = Sf^2 + Sres^2")
print(f"{S2:.2f} = {S2_F + S2_res:.2f}")

#Sf^2 = 253.91
#Sres^2 = 577.06
#S^2 = Sf^2 + Sres^2
#830.96 = 830.96

#теперь запишем оценки дисперсий


k = 3
n = n1 + n2 + n3

k1 = k - 1
k2 = n - k

sigma2_F = S2_F / k1
sigma2_res = S2_res / k2

sigma2_F, sigma2_res

print(f"Факторная дисперсия = {sigma2_F:.2f}")
print(f"Остаточная дисперсия = {sigma2_res:.2f}")

#Факторная дисперсия = 126.95
#Остаточная дисперсия = 23.08

#Значение статистики Т:

T = sigma2_F / sigma2_res
print(f"Значение статистики = {T:.2f}")

"Значение стаистики = 5.500053450812598"

f = stats.f_oneway(fp, hp, lf)
f
"F_onewayResult(statistic=5.500053450812596, pvalue=0.010482206918698694)"


#используем уровень значимости  a= 0.05, для него найдем критическое значение Fcrit:

alpha = 0.05

F_crit = stats.f.ppf(1 - alpha, k1, k2)
print(f"Критическое значение = {F_crit:.2f}")

"Критическое значение = 3.3851899614491687"

#Вывод: видим что Т>Fcrit , что говорит нам о том, что отличие среднего роста футболистов, хокеистов и штангистов действительно является статистически значимым


